IDEA Open Model
ErrorMessage Class
Compatible with IDEA StatiCa Beta 20.0
 Open Error message
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Message.OpenMessage
 IdeaRS.OpenModel.Message.ErrorMessage
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ErrorMessage : OpenMessage
Public Class ErrorMessage
	Inherits OpenMessage
The ErrorMessage type exposes the following members.
Constructors
Name | Description
ErrorMessage
 Constructor
Top
Properties
Name | Description
Description
 Description of message
 (Inherited from OpenMessage.)
InnerMessage
 Inner message
 (Inherited from OpenMessage.)
Message
 Gets the Message
 (Overrides OpenMessage.Message.)
Number
 Number of message
 (Inherited from OpenMessage.)
Object
 Affected object
 (Inherited from OpenMessage.)
PropertyName
 Affected property name
 (Inherited from OpenMessage.)
PropertyValue
 Gets the value of affected property
 (Inherited from OpenMessage.)
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace